skeleton/app/controllers/api/feeds_controller.rb

  def index
    render :json => Feed.all
---
SELECT "feeds".* FROM "feeds"

  def show
    render :json => Feed.find(params[:id]), :include => :latest_entries
---
SELECT "entries".* FROM "entries" WHERE "entries"."feed_id" = $1  [["feed_id", 1]]
SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    feed = Feed.find_or_create_by_url(feed_params[:url])
---
INSERT INTO "feeds" ("created_at", "title", "updated_at", "url") VALUES ($1, $2, $3, $4) RETURNING "id"
SELECT "feeds".* FROM "feeds" WHERE "feeds"."url" = 'test.com' LIMIT 1

  def destroy
    feed = Feed.find(params[:id])
    feed.destroy
---
SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT 1  [["id", "1"]]
DELETE FROM "feeds" WHERE "feeds"."id" = $1  [["id", 1]]